app/views/users/edit.html.erb


		<% unless @user.id == User.first.id %>
---
SELECT `users`.* FROM `users` LIMIT 1