app/controllers/casestorries_controller.rb

SELECT `casestorries`.* FROM `casestorries` WHERE (`casestorries`.`id` = 1) LIMIT 1
UPDATE `casestorries` SET `image_file_name` = 'Screen shot 2011-04-19 at 01.44.22.png', `image_content_type` = 'image/png', `image_file_size` = 171165, `image_updated_at` = '2011-04-18 23:44:34', `updated_at` = '2011-04-18 23:44:35' WHERE (`casestorries`.`id` = 3)
---
    def update
      @casestorry = Casestorry.find(params[:id])
      @casestorry.update_attributes(params[:casestorry])

INSERT INTO `casestorries` (`title`, `body`, `category`, `created_at`, `updated_at`, `image_file_name`, `image_content_type`, `image_file_size`, `image_updated_at`) VALUES ('asdf', NULL, 'asd', '2011-04-17 21:05:17', '2011-04-17 21:05:17', '254_Hotel_Saxildhus_Kolding.jpg', 'image/jpeg', 33495, '2011-04-17 21:05:17')
---
    def create
      @casestorry = Casestorry.new(params[:casestorry])
      @casestorry.image_content_type = MIME::Types.type_for(@casestorry.image.original_filename).first.to_s if @casestorry.image.original_filename.present?
      @casestorry.save