app/controllers/home_controller.rb

SELECT `casestorries`.* FROM `casestorries` ORDER BY created_at DESC LIMIT 3
---
  def index

#    @logo = Illustration.logo


   @casestorries = Casestorry.limit(3).order('created_at DESC')